import sys


a = int(sys.argv[1])
b = int(sys.argv[2])
c = int(sys.argv[3])

# найдём дискриминант
d = b * b - 4 * a * c

# если a равно нулю, то уравнение линейное: bx + c = 0
if a == 0:
    # bx = -c => x = -c / b
    if b != 0:
        print(-c / b)
    # если B равно нулю, корней нет

elif d == 0:  # случай с нулевым дискриминантом
    # корень ровно один
    print(-b / (2 * a))

else:  # в случае с положительным дискриминантом корня два
    r1 = (-b + d ** 0.5) / (2 * a)
    r2 = (-b - d ** 0.5) / (2 * a)
    print(int(r1))
    print(int(r2))
